{"format": "graph-model", "userDefinedMetadata": {"signature": {"inputs": {"input_1:0": {"dtype": "DT_FLOAT", "name": "input_1:0", "tensorShape": {"dim": [{"size": "-1"}, {"size": "187"}, {"size": "80"}]}}}, "outputs": {"Identity:0": {"dtype": "DT_INT32", "name": "Identity:0", "tensorShape": {"dim": [{"size": "1"}, {"size": "46"}, {"size": "5"}]}}, "Identity_1:0": {"dtype": "DT_FLOAT", "name": "Identity_1:0", "tensorShape": {"dim": [{"size": "1"}, {"size": "46"}, {"size": "5"}]}}}}}, "modelTopology": {"node": [{"attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "187"}, {"size": "80"}]}}}, "name": "input_1", "op": "Placeholder"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "Func/StatefulPartitionedCall/input/_26", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "Func/StatefulPartitionedCall/input/_25", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "Func/StatefulPartitionedCall/input/_20", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "Func/StatefulPartitionedCall/input/_19", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}, "name": "ConstantFolding/StatefulPartitionedCall/e2e/encoder/output_attention/truediv_11_recip", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "256"}]}}}}, "name": "Func/StatefulPartitionedCall/input/_11", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "Func/StatefulPartitionedCall/input/_12", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "256"}]}}}}, "name": "Func/StatefulPartitionedCall/input/_13", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "Func/StatefulPartitionedCall/input/_14", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "Func/StatefulPartitionedCall/input/_10", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "Func/StatefulPartitionedCall/input/_9", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}, "name": "StatefulPartitionedCall/e2e/encoder/norm1/batchnorm/add/y", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}, "name": "StatefulPartitionedCall/e2e/conv2d_subsampling_only/transpose/perm", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "name": "StatefulPartitionedCall/e2e/conv2d_subsampling_only/ExpandDims/dim", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "256"}]}}}}, "name": "Func/StatefulPartitionedCall/input/_2", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "name": "StatefulPartitionedCall/e2e/recog_output/k", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "Func/StatefulPartitionedCall/input/_3", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}, "name": "Func/StatefulPartitionedCall/input/_4", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "Func/StatefulPartitionedCall/input/_5", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}, "name": "StatefulPartitionedCall/e2e/conv2d_subsampling_only/transpose_1/perm", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}, "name": "StatefulPartitionedCall/e2e/conv2d_subsampling_only/sequential_1/out.0/Tensordot/Reshape/shape", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4864"}, {"size": "256"}]}}}}, "name": "Func/StatefulPartitionedCall/input/_6", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "Func/StatefulPartitionedCall/input/_7", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}, "name": "StatefulPartitionedCall/e2e/positional_encoding/mul/y", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "46"}, {"size": "256"}]}}}}, "name": "StatefulPartitionedCall/e2e/positional_encoding/strided_slice", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "256"}]}}}}, "name": "Func/StatefulPartitionedCall/input/_15", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "Func/StatefulPartitionedCall/input/_16", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/Reshape_44/shape", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/transpose_55/perm", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "256"}]}}}}, "name": "Func/StatefulPartitionedCall/input/_17", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "Func/StatefulPartitionedCall/input/_18", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "2048"}]}}}}, "name": "Func/StatefulPartitionedCall/input/_21", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}, "name": "StatefulPartitionedCall/e2e/encoder/ffn_output/w_1/Tensordot/shape", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}]}}}}, "name": "Func/StatefulPartitionedCall/input/_22", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}, "name": "StatefulPartitionedCall/e2e/encoder/ffn_output/w_2/Tensordot/Reshape/shape", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}, {"size": "256"}]}}}}, "name": "Func/StatefulPartitionedCall/input/_23", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/Tensordot_11/shape", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "name": "Func/StatefulPartitionedCall/input/_24", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}, "name": "StatefulPartitionedCall/e2e/encoder/norm1/moments/mean/reduction_indices", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/Tensordot_11/Reshape/shape", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "2502"}]}}}}, "name": "Func/StatefulPartitionedCall/input/_27", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}, "name": "StatefulPartitionedCall/e2e/ctc.ctc_lo/Tensordot/shape", "op": "Const"}, {"input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2502"}]}}}}, "name": "Func/StatefulPartitionedCall/input/_28", "op": "Const"}, {"input": ["input_1", "StatefulPartitionedCall/e2e/conv2d_subsampling_only/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/conv2d_subsampling_only/transpose", "op": "Transpose"}, {"input": ["StatefulPartitionedCall/e2e/conv2d_subsampling_only/transpose", "StatefulPartitionedCall/e2e/conv2d_subsampling_only/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/conv2d_subsampling_only/ExpandDims", "op": "ExpandDims"}, {"device": "/device:CPU:0", "input": ["StatefulPartitionedCall/e2e/conv2d_subsampling_only/ExpandDims", "Func/StatefulPartitionedCall/input/_2", "Func/StatefulPartitionedCall/input/_3"], "attr": {"explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}, "name": "StatefulPartitionedCall/e2e/conv2d_subsampling_only/sequential/conv.0/Relu", "op": "_FusedConv2D"}, {"device": "/device:CPU:0", "input": ["StatefulPartitionedCall/e2e/conv2d_subsampling_only/sequential/conv.0/Relu", "Func/StatefulPartitionedCall/input/_4", "Func/StatefulPartitionedCall/input/_5"], "attr": {"explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}, "name": "StatefulPartitionedCall/e2e/conv2d_subsampling_only/sequential/conv.2/Relu", "op": "_FusedConv2D"}, {"input": ["StatefulPartitionedCall/e2e/conv2d_subsampling_only/sequential/conv.2/Relu", "StatefulPartitionedCall/e2e/conv2d_subsampling_only/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/conv2d_subsampling_only/transpose_1", "op": "Transpose"}, {"input": ["StatefulPartitionedCall/e2e/conv2d_subsampling_only/transpose_1", "StatefulPartitionedCall/e2e/encoder/output_attention/transpose_55/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/conv2d_subsampling_only/transpose_2", "op": "Transpose"}, {"input": ["StatefulPartitionedCall/e2e/conv2d_subsampling_only/transpose_2", "StatefulPartitionedCall/e2e/conv2d_subsampling_only/sequential_1/out.0/Tensordot/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "StatefulPartitionedCall/e2e/conv2d_subsampling_only/sequential_1/out.0/Tensordot/Reshape", "op": "Reshape"}, {"device": "/device:CPU:0", "input": ["StatefulPartitionedCall/e2e/conv2d_subsampling_only/sequential_1/out.0/Tensordot/Reshape", "Func/StatefulPartitionedCall/input/_6"], "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/conv2d_subsampling_only/sequential_1/out.0/Tensordot/MatMul", "op": "MatMul"}, {"input": ["StatefulPartitionedCall/e2e/conv2d_subsampling_only/sequential_1/out.0/Tensordot/MatMul", "StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/Tensordot_11/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/conv2d_subsampling_only/sequential_1/out.0/Tensordot", "op": "Reshape"}, {"input": ["StatefulPartitionedCall/e2e/conv2d_subsampling_only/sequential_1/out.0/Tensordot", "Func/StatefulPartitionedCall/input/_7"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "name": "StatefulPartitionedCall/e2e/conv2d_subsampling_only/sequential_1/out.0/BiasAdd", "op": "BiasAdd"}, {"input": ["StatefulPartitionedCall/e2e/conv2d_subsampling_only/sequential_1/out.0/BiasAdd", "StatefulPartitionedCall/e2e/positional_encoding/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/positional_encoding/mul", "op": "Mul"}, {"input": ["StatefulPartitionedCall/e2e/positional_encoding/mul", "StatefulPartitionedCall/e2e/positional_encoding/strided_slice"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/positional_encoding/add", "op": "AddV2"}, {"input": ["StatefulPartitionedCall/e2e/positional_encoding/add", "StatefulPartitionedCall/e2e/encoder/norm1/moments/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm1/moments/mean", "op": "Mean"}, {"input": ["StatefulPartitionedCall/e2e/encoder/norm1/moments/mean", "StatefulPartitionedCall/e2e/positional_encoding/add"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm1/moments/SquaredDifference", "op": "SquaredDifference"}, {"input": ["StatefulPartitionedCall/e2e/encoder/norm1/moments/SquaredDifference", "StatefulPartitionedCall/e2e/encoder/norm1/moments/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm1/moments/variance", "op": "Mean"}, {"input": ["StatefulPartitionedCall/e2e/encoder/norm1/batchnorm/add/y", "StatefulPartitionedCall/e2e/encoder/norm1/moments/variance"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm1/batchnorm/add", "op": "AddV2"}, {"input": ["StatefulPartitionedCall/e2e/encoder/norm1/batchnorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm1/batchnorm/Rsqrt", "op": "Rsqrt"}, {"input": ["Func/StatefulPartitionedCall/input/_9", "StatefulPartitionedCall/e2e/encoder/norm1/batchnorm/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm1/batchnorm/mul", "op": "Mul"}, {"input": ["StatefulPartitionedCall/e2e/encoder/norm1/batchnorm/mul", "StatefulPartitionedCall/e2e/positional_encoding/add"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm1/batchnorm/mul_1", "op": "Mul"}, {"input": ["StatefulPartitionedCall/e2e/encoder/norm1/batchnorm/mul", "StatefulPartitionedCall/e2e/encoder/norm1/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm1/batchnorm/mul_2", "op": "Mul"}, {"input": ["Func/StatefulPartitionedCall/input/_10", "StatefulPartitionedCall/e2e/encoder/norm1/batchnorm/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm1/batchnorm/sub", "op": "Sub"}, {"input": ["StatefulPartitionedCall/e2e/encoder/norm1/batchnorm/mul_1", "StatefulPartitionedCall/e2e/encoder/norm1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm1/batchnorm/add_1", "op": "AddV2"}, {"input": ["StatefulPartitionedCall/e2e/encoder/norm1/batchnorm/add_1", "StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/Tensordot_11/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/Tensordot/Reshape", "op": "Reshape"}, {"device": "/device:CPU:0", "input": ["StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/Tensordot/Reshape", "Func/StatefulPartitionedCall/input/_11"], "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/Tensordot/MatMul", "op": "MatMul"}, {"device": "/device:CPU:0", "input": ["StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/Tensordot/Reshape", "Func/StatefulPartitionedCall/input/_13"], "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/linear_k/Tensordot/MatMul", "op": "MatMul"}, {"device": "/device:CPU:0", "input": ["StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/Tensordot/Reshape", "Func/StatefulPartitionedCall/input/_15"], "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/linear_v/Tensordot/MatMul", "op": "MatMul"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/Tensordot/MatMul", "StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/Tensordot_11/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/Tensordot", "op": "Reshape"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/linear_k/Tensordot/MatMul", "StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/Tensordot_11/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/linear_k/Tensordot", "op": "Reshape"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/linear_v/Tensordot/MatMul", "StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/Tensordot_11/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/linear_v/Tensordot", "op": "Reshape"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/Tensordot", "Func/StatefulPartitionedCall/input/_12"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/BiasAdd", "op": "BiasAdd"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/linear_k/Tensordot", "Func/StatefulPartitionedCall/input/_14"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/linear_k/BiasAdd", "op": "BiasAdd"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/linear_v/Tensordot", "Func/StatefulPartitionedCall/input/_16"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/linear_v/BiasAdd", "op": "BiasAdd"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/BiasAdd", "StatefulPartitionedCall/e2e/encoder/output_attention/Reshape_44/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/Reshape", "op": "Reshape"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/linear_k/BiasAdd", "StatefulPartitionedCall/e2e/encoder/output_attention/Reshape_44/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/Reshape_1", "op": "Reshape"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/linear_v/BiasAdd", "StatefulPartitionedCall/e2e/encoder/output_attention/Reshape_44/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/Reshape_2", "op": "Reshape"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/Reshape", "StatefulPartitionedCall/e2e/encoder/output_attention/transpose_55/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/transpose", "op": "Transpose"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/Reshape_1", "StatefulPartitionedCall/e2e/encoder/output_attention/transpose_55/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/transpose_1", "op": "Transpose"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/Reshape_2", "StatefulPartitionedCall/e2e/encoder/output_attention/transpose_55/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/transpose_2", "op": "Transpose"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/transpose", "StatefulPartitionedCall/e2e/encoder/output_attention/transpose_1"], "attr": {"adj_y": {"b": true}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/ArithmeticOptimizer/FoldTransposeIntoMatMul_MatMul", "op": "BatchMatMulV2"}, {"input": ["ConstantFolding/StatefulPartitionedCall/e2e/encoder/output_attention/truediv_11_recip", "StatefulPartitionedCall/e2e/encoder/output_attention/ArithmeticOptimizer/FoldTransposeIntoMatMul_MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/truediv", "op": "Mul"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/Softmax", "op": "Softmax"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/Softmax", "StatefulPartitionedCall/e2e/encoder/output_attention/transpose_2"], "attr": {"adj_y": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/MatMul_1", "op": "BatchMatMulV2"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/MatMul_1", "StatefulPartitionedCall/e2e/encoder/output_attention/transpose_55/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/transpose_4", "op": "Transpose"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/transpose_4", "StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/Tensordot_11/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/linear_out/Tensordot/Reshape", "op": "Reshape"}, {"device": "/device:CPU:0", "input": ["StatefulPartitionedCall/e2e/encoder/output_attention/linear_out/Tensordot/Reshape", "Func/StatefulPartitionedCall/input/_17"], "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/linear_out/Tensordot/MatMul", "op": "MatMul"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/linear_out/Tensordot/MatMul", "StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/Tensordot_11/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/linear_out/Tensordot", "op": "Reshape"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/linear_out/Tensordot", "Func/StatefulPartitionedCall/input/_18"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/linear_out/BiasAdd", "op": "BiasAdd"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/linear_out/BiasAdd", "StatefulPartitionedCall/e2e/positional_encoding/add"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/add", "op": "AddV2"}, {"input": ["StatefulPartitionedCall/e2e/encoder/add", "StatefulPartitionedCall/e2e/encoder/norm1/moments/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm2/moments/mean", "op": "Mean"}, {"input": ["StatefulPartitionedCall/e2e/encoder/add", "StatefulPartitionedCall/e2e/encoder/norm2/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm2/moments/SquaredDifference", "op": "SquaredDifference"}, {"input": ["StatefulPartitionedCall/e2e/encoder/norm2/moments/SquaredDifference", "StatefulPartitionedCall/e2e/encoder/norm1/moments/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm2/moments/variance", "op": "Mean"}, {"input": ["StatefulPartitionedCall/e2e/encoder/norm1/batchnorm/add/y", "StatefulPartitionedCall/e2e/encoder/norm2/moments/variance"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm2/batchnorm/add", "op": "AddV2"}, {"input": ["StatefulPartitionedCall/e2e/encoder/norm2/batchnorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm2/batchnorm/Rsqrt", "op": "Rsqrt"}, {"input": ["Func/StatefulPartitionedCall/input/_19", "StatefulPartitionedCall/e2e/encoder/norm2/batchnorm/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm2/batchnorm/mul", "op": "Mul"}, {"input": ["StatefulPartitionedCall/e2e/encoder/norm2/batchnorm/mul", "StatefulPartitionedCall/e2e/encoder/norm2/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm2/batchnorm/mul_2", "op": "Mul"}, {"input": ["StatefulPartitionedCall/e2e/encoder/add", "StatefulPartitionedCall/e2e/encoder/norm2/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm2/batchnorm/mul_1", "op": "Mul"}, {"input": ["Func/StatefulPartitionedCall/input/_20", "StatefulPartitionedCall/e2e/encoder/norm2/batchnorm/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm2/batchnorm/sub", "op": "Sub"}, {"input": ["StatefulPartitionedCall/e2e/encoder/norm2/batchnorm/mul_1", "StatefulPartitionedCall/e2e/encoder/norm2/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm2/batchnorm/add_1", "op": "AddV2"}, {"input": ["StatefulPartitionedCall/e2e/encoder/norm2/batchnorm/add_1", "StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/Tensordot_11/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "StatefulPartitionedCall/e2e/encoder/ffn_output/w_1/Tensordot/Reshape", "op": "Reshape"}, {"device": "/device:CPU:0", "input": ["StatefulPartitionedCall/e2e/encoder/ffn_output/w_1/Tensordot/Reshape", "Func/StatefulPartitionedCall/input/_21"], "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/ffn_output/w_1/Tensordot/MatMul", "op": "MatMul"}, {"input": ["StatefulPartitionedCall/e2e/encoder/ffn_output/w_1/Tensordot/MatMul", "StatefulPartitionedCall/e2e/encoder/ffn_output/w_1/Tensordot/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "StatefulPartitionedCall/e2e/encoder/ffn_output/w_1/Tensordot", "op": "Reshape"}, {"input": ["StatefulPartitionedCall/e2e/encoder/ffn_output/w_1/Tensordot", "Func/StatefulPartitionedCall/input/_22"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "name": "StatefulPartitionedCall/e2e/encoder/ffn_output/w_1/BiasAdd", "op": "BiasAdd"}, {"input": ["StatefulPartitionedCall/e2e/encoder/ffn_output/w_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/ffn_output/w_1/Relu", "op": "Relu"}, {"input": ["StatefulPartitionedCall/e2e/encoder/ffn_output/w_1/Relu", "StatefulPartitionedCall/e2e/encoder/ffn_output/w_2/Tensordot/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/ffn_output/w_2/Tensordot/Reshape", "op": "Reshape"}, {"device": "/device:CPU:0", "input": ["StatefulPartitionedCall/e2e/encoder/ffn_output/w_2/Tensordot/Reshape", "Func/StatefulPartitionedCall/input/_23"], "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/ffn_output/w_2/Tensordot/MatMul", "op": "MatMul"}, {"input": ["StatefulPartitionedCall/e2e/encoder/ffn_output/w_2/Tensordot/MatMul", "StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/Tensordot_11/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/ffn_output/w_2/Tensordot", "op": "Reshape"}, {"input": ["StatefulPartitionedCall/e2e/encoder/ffn_output/w_2/Tensordot", "Func/StatefulPartitionedCall/input/_24"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/ffn_output/w_2/BiasAdd", "op": "BiasAdd"}, {"input": ["StatefulPartitionedCall/e2e/encoder/add", "StatefulPartitionedCall/e2e/encoder/ffn_output/w_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/add_1", "op": "AddV2"}, {"input": ["StatefulPartitionedCall/e2e/encoder/add_1", "StatefulPartitionedCall/e2e/encoder/norm1/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}, "name": "StatefulPartitionedCall/e2e/after_norm/moments/mean", "op": "Mean"}, {"input": ["StatefulPartitionedCall/e2e/after_norm/moments/mean", "StatefulPartitionedCall/e2e/encoder/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/after_norm/moments/SquaredDifference", "op": "SquaredDifference"}, {"input": ["StatefulPartitionedCall/e2e/after_norm/moments/SquaredDifference", "StatefulPartitionedCall/e2e/encoder/norm1/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}, "name": "StatefulPartitionedCall/e2e/after_norm/moments/variance", "op": "Mean"}, {"input": ["StatefulPartitionedCall/e2e/after_norm/moments/variance", "StatefulPartitionedCall/e2e/encoder/norm1/batchnorm/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/after_norm/batchnorm/add", "op": "AddV2"}, {"input": ["StatefulPartitionedCall/e2e/after_norm/batchnorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/after_norm/batchnorm/Rsqrt", "op": "Rsqrt"}, {"input": ["Func/StatefulPartitionedCall/input/_25", "StatefulPartitionedCall/e2e/after_norm/batchnorm/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/after_norm/batchnorm/mul", "op": "Mul"}, {"input": ["StatefulPartitionedCall/e2e/after_norm/batchnorm/mul", "StatefulPartitionedCall/e2e/after_norm/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/after_norm/batchnorm/mul_2", "op": "Mul"}, {"input": ["StatefulPartitionedCall/e2e/after_norm/batchnorm/mul", "StatefulPartitionedCall/e2e/encoder/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/after_norm/batchnorm/mul_1", "op": "Mul"}, {"input": ["Func/StatefulPartitionedCall/input/_26", "StatefulPartitionedCall/e2e/after_norm/batchnorm/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/after_norm/batchnorm/sub", "op": "Sub"}, {"input": ["StatefulPartitionedCall/e2e/after_norm/batchnorm/mul_1", "StatefulPartitionedCall/e2e/after_norm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/after_norm/batchnorm/add_1", "op": "AddV2"}, {"input": ["StatefulPartitionedCall/e2e/after_norm/batchnorm/add_1", "StatefulPartitionedCall/e2e/encoder/norm1/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm1/moments_1/mean", "op": "Mean"}, {"input": ["StatefulPartitionedCall/e2e/after_norm/batchnorm/add_1", "StatefulPartitionedCall/e2e/encoder/norm1/moments_1/mean"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm1/moments_1/SquaredDifference", "op": "SquaredDifference"}, {"input": ["StatefulPartitionedCall/e2e/encoder/norm1/moments_1/SquaredDifference", "StatefulPartitionedCall/e2e/encoder/norm1/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm1/moments_1/variance", "op": "Mean"}, {"input": ["StatefulPartitionedCall/e2e/encoder/norm1/batchnorm/add/y", "StatefulPartitionedCall/e2e/encoder/norm1/moments_1/variance"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm1/batchnorm_1/add", "op": "AddV2"}, {"input": ["StatefulPartitionedCall/e2e/encoder/norm1/batchnorm_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm1/batchnorm_1/Rsqrt", "op": "Rsqrt"}, {"input": ["Func/StatefulPartitionedCall/input/_9", "StatefulPartitionedCall/e2e/encoder/norm1/batchnorm_1/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm1/batchnorm_1/mul", "op": "Mul"}, {"input": ["StatefulPartitionedCall/e2e/encoder/norm1/batchnorm_1/mul", "StatefulPartitionedCall/e2e/encoder/norm1/moments_1/mean"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm1/batchnorm_1/mul_2", "op": "Mul"}, {"input": ["StatefulPartitionedCall/e2e/after_norm/batchnorm/add_1", "StatefulPartitionedCall/e2e/encoder/norm1/batchnorm_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm1/batchnorm_1/mul_1", "op": "Mul"}, {"input": ["Func/StatefulPartitionedCall/input/_10", "StatefulPartitionedCall/e2e/encoder/norm1/batchnorm_1/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm1/batchnorm_1/sub", "op": "Sub"}, {"input": ["StatefulPartitionedCall/e2e/encoder/norm1/batchnorm_1/mul_1", "StatefulPartitionedCall/e2e/encoder/norm1/batchnorm_1/sub"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm1/batchnorm_1/add_1", "op": "AddV2"}, {"input": ["StatefulPartitionedCall/e2e/encoder/norm1/batchnorm_1/add_1", "StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/Tensordot_11/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/Tensordot_1/Reshape", "op": "Reshape"}, {"device": "/device:CPU:0", "input": ["StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/Tensordot_1/Reshape", "Func/StatefulPartitionedCall/input/_11"], "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/Tensordot_1/MatMul", "op": "MatMul"}, {"device": "/device:CPU:0", "input": ["StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/Tensordot_1/Reshape", "Func/StatefulPartitionedCall/input/_13"], "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/linear_k/Tensordot_1/MatMul", "op": "MatMul"}, {"device": "/device:CPU:0", "input": ["StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/Tensordot_1/Reshape", "Func/StatefulPartitionedCall/input/_15"], "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/linear_v/Tensordot_1/MatMul", "op": "MatMul"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/Tensordot_1/MatMul", "StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/Tensordot_11/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/Tensordot_1", "op": "Reshape"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/linear_k/Tensordot_1/MatMul", "StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/Tensordot_11/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/linear_k/Tensordot_1", "op": "Reshape"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/linear_v/Tensordot_1/MatMul", "StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/Tensordot_11/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/linear_v/Tensordot_1", "op": "Reshape"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/Tensordot_1", "Func/StatefulPartitionedCall/input/_12"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/BiasAdd_1", "op": "BiasAdd"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/linear_k/Tensordot_1", "Func/StatefulPartitionedCall/input/_14"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/linear_k/BiasAdd_1", "op": "BiasAdd"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/linear_v/Tensordot_1", "Func/StatefulPartitionedCall/input/_16"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/linear_v/BiasAdd_1", "op": "BiasAdd"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/BiasAdd_1", "StatefulPartitionedCall/e2e/encoder/output_attention/Reshape_44/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/Reshape_4", "op": "Reshape"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/linear_k/BiasAdd_1", "StatefulPartitionedCall/e2e/encoder/output_attention/Reshape_44/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/Reshape_5", "op": "Reshape"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/linear_v/BiasAdd_1", "StatefulPartitionedCall/e2e/encoder/output_attention/Reshape_44/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/Reshape_6", "op": "Reshape"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/Reshape_4", "StatefulPartitionedCall/e2e/encoder/output_attention/transpose_55/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/transpose_5", "op": "Transpose"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/Reshape_5", "StatefulPartitionedCall/e2e/encoder/output_attention/transpose_55/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/transpose_6", "op": "Transpose"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/Reshape_6", "StatefulPartitionedCall/e2e/encoder/output_attention/transpose_55/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/transpose_7", "op": "Transpose"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/transpose_5", "StatefulPartitionedCall/e2e/encoder/output_attention/transpose_6"], "attr": {"adj_y": {"b": true}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/ArithmeticOptimizer/FoldTransposeIntoMatMul_MatMul_2", "op": "BatchMatMulV2"}, {"input": ["ConstantFolding/StatefulPartitionedCall/e2e/encoder/output_attention/truediv_11_recip", "StatefulPartitionedCall/e2e/encoder/output_attention/ArithmeticOptimizer/FoldTransposeIntoMatMul_MatMul_2"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/truediv_1", "op": "Mul"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/truediv_1"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/Softmax_1", "op": "Softmax"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/Softmax_1", "StatefulPartitionedCall/e2e/encoder/output_attention/transpose_7"], "attr": {"adj_y": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/MatMul_3", "op": "BatchMatMulV2"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/MatMul_3", "StatefulPartitionedCall/e2e/encoder/output_attention/transpose_55/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/transpose_9", "op": "Transpose"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/transpose_9", "StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/Tensordot_11/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/linear_out/Tensordot_1/Reshape", "op": "Reshape"}, {"device": "/device:CPU:0", "input": ["StatefulPartitionedCall/e2e/encoder/output_attention/linear_out/Tensordot_1/Reshape", "Func/StatefulPartitionedCall/input/_17"], "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/linear_out/Tensordot_1/MatMul", "op": "MatMul"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/linear_out/Tensordot_1/MatMul", "StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/Tensordot_11/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/linear_out/Tensordot_1", "op": "Reshape"}, {"input": ["StatefulPartitionedCall/e2e/encoder/output_attention/linear_out/Tensordot_1", "Func/StatefulPartitionedCall/input/_18"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "name": "StatefulPartitionedCall/e2e/encoder/output_attention/linear_out/BiasAdd_1", "op": "BiasAdd"}, {"input": ["StatefulPartitionedCall/e2e/after_norm/batchnorm/add_1", "StatefulPartitionedCall/e2e/encoder/output_attention/linear_out/BiasAdd_1"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/add_2", "op": "AddV2"}, {"input": ["StatefulPartitionedCall/e2e/encoder/add_2", "StatefulPartitionedCall/e2e/encoder/norm1/moments/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm2/moments_1/mean", "op": "Mean"}, {"input": ["StatefulPartitionedCall/e2e/encoder/add_2", "StatefulPartitionedCall/e2e/encoder/norm2/moments_1/mean"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm2/moments_1/SquaredDifference", "op": "SquaredDifference"}, {"input": ["StatefulPartitionedCall/e2e/encoder/norm2/moments_1/SquaredDifference", "StatefulPartitionedCall/e2e/encoder/norm1/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm2/moments_1/variance", "op": "Mean"}, {"input": ["StatefulPartitionedCall/e2e/encoder/norm1/batchnorm/add/y", "StatefulPartitionedCall/e2e/encoder/norm2/moments_1/variance"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm2/batchnorm_1/add", "op": "AddV2"}, {"input": ["StatefulPartitionedCall/e2e/encoder/norm2/batchnorm_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm2/batchnorm_1/Rsqrt", "op": "Rsqrt"}, {"input": ["Func/StatefulPartitionedCall/input/_19", "StatefulPartitionedCall/e2e/encoder/norm2/batchnorm_1/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm2/batchnorm_1/mul", "op": "Mul"}, {"input": ["StatefulPartitionedCall/e2e/encoder/norm2/batchnorm_1/mul", "StatefulPartitionedCall/e2e/encoder/norm2/moments_1/mean"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm2/batchnorm_1/mul_2", "op": "Mul"}, {"input": ["StatefulPartitionedCall/e2e/encoder/add_2", "StatefulPartitionedCall/e2e/encoder/norm2/batchnorm_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm2/batchnorm_1/mul_1", "op": "Mul"}, {"input": ["Func/StatefulPartitionedCall/input/_20", "StatefulPartitionedCall/e2e/encoder/norm2/batchnorm_1/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm2/batchnorm_1/sub", "op": "Sub"}, {"input": ["StatefulPartitionedCall/e2e/encoder/norm2/batchnorm_1/mul_1", "StatefulPartitionedCall/e2e/encoder/norm2/batchnorm_1/sub"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/norm2/batchnorm_1/add_1", "op": "AddV2"}, {"input": ["StatefulPartitionedCall/e2e/encoder/norm2/batchnorm_1/add_1", "StatefulPartitionedCall/e2e/encoder/output_attention/linear_q/Tensordot_11/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "StatefulPartitionedCall/e2e/encoder/ffn_output/w_1/Tensordot_1/Reshape", "op": "Reshape"}, {"device": "/device:CPU:0", "input": ["StatefulPartitionedCall/e2e/encoder/ffn_output/w_1/Tensordot_1/Reshape", "Func/StatefulPartitionedCall/input/_21"], "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/ffn_output/w_1/Tensordot_1/MatMul", "op": "MatMul"}, {"input": ["StatefulPartitionedCall/e2e/encoder/ffn_output/w_1/Tensordot_1/MatMul", "StatefulPartitionedCall/e2e/encoder/ffn_output/w_1/Tensordot/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "StatefulPartitionedCall/e2e/encoder/ffn_output/w_1/Tensordot_1", "op": "Reshape"}, {"input": ["StatefulPartitionedCall/e2e/encoder/ffn_output/w_1/Tensordot_1", "Func/StatefulPartitionedCall/input/_22"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/ffn_output/w_1/BiasAdd_1", "op": "BiasAdd"}, {"input": ["StatefulPartitionedCall/e2e/encoder/ffn_output/w_1/BiasAdd_1"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "StatefulPartitionedCall/e2e/encoder/ffn_output/w_1/Relu_1", "op": "Relu"}, {"input": ["StatefulPartitionedCall/e2e/encoder/ffn_output/w_1/Relu_1", "StatefulPartitionedCall/e2e/encoder/ffn_output/w_2/Tensordot/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "StatefulPartitionedCall/e2e/encoder/ffn_output/w_2/Tensordot_1/Reshape", "op": "Reshape"}, {"device": "/device:CPU:0", "input": ["StatefulPartitionedCall/e2e/encoder/ffn_output/w_2/Tensordot_1/Reshape", "Func/StatefulPartitionedCall/input/_23"], "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": 